[net]
batch=8
subdivisions=4
width=1280
height=960
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.00000025
burn_in=100

max_batches = 262500
policy=steps
steps=25000,50000,100000
scales=.5,.5,.5
gaussian_noise=1
flip=1


# 0
[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=relu
#precision=fp16

# 1
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 8
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=relu


[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 16
[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 24
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 32
[convolutional]
sparse=1
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=relu


##################################

### ASPPCSP ###
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers = -2

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

### ASPP ###
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=3
activation=relu

[route]
layers=-4

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=5
activation=relu

[route]
layers=-1,-3,-5,-6
### End SPP ###

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers = -10,-1

# 44
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu
### End SPPCSP ###

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

[route]
layers = 30

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers = -1,-3

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7


# 56
[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

[route]
layers = 20

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers = -1,-3

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 68
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

##########################

[convolutional]
sparse=1
batch_normalize=1
size=3
stride=2
pad=1
filters=128
activation=relu

[route]
layers = -1,67

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 77
[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=relu

[route]
layers = -1,53

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 86
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#############################

# ============ End of Neck ============ #

# ============ Head ============ #


# P3
[route]
layers = 80

[convolutional]
sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=relu

[convolutional]
#sparse=1
size=1
stride=1
pad=1
filters=45
#activation=linear
activation=logistic


[yolo]
mask = 0,1,2
anchors =  7, 14,  17, 21,  11, 38,  31, 40,  21, 84,  57, 69,  87,130, 148,198, 215,337
classes=10
num=9
jitter=.3
scale_x_y = 2.0
ignore_thresh = .5
truth_thresh = 1
resize=1.5
new_coords=1
names=car,bus,person,                bike,truck,motor,               train,rider,traffic_sign,    traffic_light
colormap=0,0,255, 0,0,235, 255,0,0,  128,128,0, 0,0,225, 128,255,0,  0,0,200, 255,0,128, 0,255,0  255,0,255

# P4
[route]
layers = 91

[convolutional]
sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=relu

[convolutional]
#sparse=1
size=1
stride=1
pad=1
filters=45
#activation=linear
activation=logistic

[yolo]
mask = 3,4,5
anchors =  7, 14,  17, 21,  11, 38,  31, 40,  21, 84,  57, 69,  87,130, 148,198, 215,337
classes=10
num=9
jitter=.3
scale_x_y = 2.0
ignore_thresh = .5
truth_thresh = 1
resize=1.5
new_coords=1
names=car,bus,person,                bike,truck,motor,               train,rider,traffic_sign,    traffic_light
colormap=0,0,255, 0,0,235, 255,0,0,  128,128,0, 0,0,225, 128,255,0,  0,0,200, 255,0,128, 0,255,0  255,0,255


# P5
[route]
layers = 102

[convolutional]
sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=relu

[convolutional]
#sparse=1
size=1
stride=1
pad=1
filters=45
#activation=linear
activation=logistic

[yolo]
mask = 6,7,8
anchors =  7, 14,  17, 21,  11, 38,  31, 40,  21, 84,  57, 69,  87,130, 148,198, 215,337
classes=10
num=9
jitter=.3
scale_x_y = 2.0
ignore_thresh = .5
truth_thresh = 1
resize=1.5
new_coords=1
names=car,bus,person,                bike,truck,motor,               train,rider,traffic_sign,    traffic_light
colormap=0,0,255, 0,0,235, 255,0,0,  128,128,0, 0,0,225, 128,255,0,  0,0,200, 255,0,128, 0,255,0  255,0,255

[route]
layers = 102,53

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=1

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=3

[route]
layers = -1,-3,-5,-7

# 86
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2
#80x60

[route]
layers = -1,91,30

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=1

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=3

[route]
layers = -1,-3,-5,-7

# 86
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2
#160x120

[route]
layers = -1,80,20

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=1

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=3

[route]
layers = -1,-3,-5,-7

# 86
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2
#320x240

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[upsample]
stride=2
#640x480

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=20
activation=linear
#precision=fp16

[softmax]
groups=307200
stride=307200
#BGR
num=20
classes=20
colormap=128,64,128, 244,35,232, 70,70,70, 102,102,156,		190,153,153, 153,153,153, 250,170,30, 220,220,0,	107,142,35, 152,251,152, 70,130,180, 220,20,60,		 255,0,0, 0,0,142, 0,0,70, 0,60,100,	0,80,100, 0,0,230, 119,11,32, 0,0,0
