[net]
batch=8
subdivisions=4
width=640
height=640
channels=3
momentum=0.900000
decay=0.000500
angle=0
saturation=1.500000
exposure=1.500000
hue=0.100000

#learning_rate=0.010000
#learning_rate=0.0050000
##learning_rate=0.00250000
#learning_rate=0.00050000
learning_rate=0.00010000
#learning_rate_min=0.000010
#burn_in=600000
burn_in=6000
max_batches = 3062500
policy=steps
steps=218750,875000,1750000,1750000
scales=0.500000,0.500000,0.500000,0.500000

gaussian_noise=1
flip=1


[convolutional]
batch_normalize=1
filters=80
size=3
stride=2
pad=1
activation=swish

#320x320
[convolutional]
batch_normalize=1
filters=160
size=3
stride=2
pad=1
activation=swish

#160x160
[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[route]
layers = -11,-7,-4,-1

[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=2
pad=1
activation=swish

#80x80
[convolutional]
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[route]
layers = -20,-16,-13,-10,-7,-4,-1

[convolutional]
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=640
size=3
stride=2
pad=1
activation=swish

#40x40

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear


[route]
layers = -20,-16,-13,-10,-7,-4,-1

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=640
size=3
stride=2
pad=1
activation=swish

#20x20
[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[route]
layers = -11,-7,-4,-1

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

### SPP ###
[maxpool]
stride=1
size=5

[route]
layers	=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6
### End SPP ###

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

#end of backend

[upsample]
stride=2

#40x40
[route]
layers	= -1, -24

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[route]
layers=-8,-5,-3,-1

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[upsample]
stride=2

#80x80
[route]
layers	= -1, -59

[convolutional]
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[route]
layers=-8,-5,-3,-1

[convolutional]
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=2
pad=1
activation=swish

#40x40
[route]
layers	= -1, -14

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[route]
layers=-8,-5,-3,-1

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=640
size=3
stride=2
pad=1
activation=swish

#40x40
[route]
layers	= -1,-38

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=640
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[route]
layers=-8,-5,-3,-1

[convolutional]
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

#end of neck

#head1 80x80

[route]
layers=106

[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=0
activation=swish

#L191 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

#L192 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

#L193 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L194 
[route]
layers=-2

#L195 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L196 
[route]
layers=-4

#L197 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L198 
[route]
layers=-8

#L199 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

#L200 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

#L201 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L202 
[route]
layers=-2

#L203 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L204 
[route]
layers=-4

#L205 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L206 
[route]
layers=-5,-13,-3,-11,-1,-9

#L207 
[yolo]
mask = 0,1,2
anchors =   7, 14,  17, 21,  11, 38,  31, 40,  21, 84,  57, 69,  87,130, 148,198, 215,337
classes=10
num=9
jitter=0.300000
ignore_thresh = .5
new_coords=1
scale_x_y=2.000000

#head2 40x40

[route]
layers=118

[convolutional]
batch_normalize=1
filters=320
size=1
stride=1
pad=0
activation=swish

#L191 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L192 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L193 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L194 
[route]
layers=-2

#L195 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L196 
[route]
layers=-4

#L197 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L198 
[route]
layers=-8

#L199 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L200 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L201 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L202 
[route]
layers=-2

#L203 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L204 
[route]
layers=-4

#L205 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L206 
[route]
layers=-5,-13,-3,-11,-1,-9

#L207 
[yolo]
mask = 3,4,5
anchors =   7, 14,  17, 21,  11, 38,  31, 40,  21, 84,  57, 69,  87,130, 148,198, 215,337
classes=10
num=9
jitter=0.300000
ignore_thresh = .5
new_coords=1
scale_x_y=2.000000


#head3 20x20

[route]
layers=130

[convolutional]
batch_normalize=1
filters=320
size=1
stride=1
pad=0
activation=swish

#L191 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L192 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L193 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L194 
[route]
layers=-2

#L195 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L196 
[route]
layers=-4

#L197 64x64 0.005GFLOPS
[convolutional]
filters=10
size=1
stride=1
pad=0
activation=logistic

#L198 
[route]
layers=-8

#L199 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L200 64x64 0.302GFLOPS
[convolutional]
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L201 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L202 
[route]
layers=-2

#L203 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L204 
[route]
layers=-4

#L205 64x64 0.003GFLOPS
[convolutional]
filters=5
size=1
stride=1
pad=0
activation=logistic

#L206 
[route]
layers=-5,-13,-3,-11,-1,-9

#L207 
[yolo]
mask = 6,7,8
anchors =   7, 14,  17, 21,  11, 38,  31, 40,  21, 84,  57, 69,  87,130, 148,198, 215,337
classes=10
num=9
jitter=0.300000
ignore_thresh = .5
new_coords=1
scale_x_y=2.000000