[net]
batch=8
subdivisions=8
width=640
height=640
channels=3
momentum=0.900000
decay=0.000500
angle=0
saturation=2.500000
exposure=2.500000
hue=0.200000

learning_rate=0.0000001
learning_rate_min=0.000000001
burn_in=100

max_batches = 262500
policy=sgdr
sgdr_cycle=1000
sgdr_mult=2
flip=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=80
size=3
stride=2
pad=1
activation=swish

#320x320
[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=2
pad=1
activation=swish

#160x160
[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=80
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[route]
layers = -11,-7,-4,-1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=2
pad=1
activation=swish

#80x80
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[route]
layers = -20,-16,-13,-10,-7,-4,-1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=3
stride=2
pad=1
activation=swish

#40x40

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear


[route]
layers = -20,-16,-13,-10,-7,-4,-1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=3
stride=2
pad=1
activation=swish

#20x20
[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[shortcut]
from=-3
activation=linear

[route]
layers = -11,-7,-4,-1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

### SPP ###
[maxpool]
stride=1
size=5

[route]
layers	=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6
### End SPP ###

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

#end of backend

[upsample]
stride=2

#40x40
[route]
layers	= -1, -24

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[route]
layers=-8,-5,-3,-1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[upsample]
stride=2

#80x80
[route]
layers	= -1, -59

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

[route]
layers=-8,-5,-3,-1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=1
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=2
pad=1
activation=swish

#40x40
[route]
layers	= -1, -14

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[route]
layers=-8,-5,-3,-1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=3
stride=2
pad=1
activation=swish

#40x40
[route]
layers	= -1,-38

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

[route]
layers=-1
groups=2
group_id=1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

[route]
layers=-8,-5,-3,-1

[convolutional]
dont_update=99999999
batch_normalize=1
filters=640
size=1
stride=1
pad=1
activation=swish

#end of neck

#head1 80x80

[route]
layers=106

[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=1
stride=1
pad=0
activation=swish

#L191 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

#L192 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

#L193 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L194
[route]
layers=-2

#L195 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L196
[route]
layers=-4

#L197 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L198
[route]
layers=-8

#L199 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

#L200 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=swish

#L201 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L202
[route]
layers=-2

#L203 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L204
[route]
layers=-4

#L205 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L206
[route]
layers=-5,-13,-3,-11,-1,-9

#L207
[route]
layers = -1
stopbackward=1
#[yolo]

#head2 40x40

[route]
layers=118

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=1
stride=1
pad=0
activation=swish

#L191 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L192 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L193 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L194
[route]
layers=-2

#L195 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L196
[route]
layers=-4

#L197 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L198
[route]
layers=-8

#L199 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L200 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L201 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L202
[route]
layers=-2

#L203 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L204
[route]
layers=-4

#L205 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L206
[route]
layers=-5,-13,-3,-11,-1,-9

[route]
layers = -1
stopbackward=1
#[yolo]


#head3 20x20

[route]
layers=130

[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=1
stride=1
pad=0
activation=swish

#L191 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L192 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L193 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L194
[route]
layers=-2

#L195 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L196
[route]
layers=-4

#L197 64x64 0.005GFLOPS
[convolutional]
dont_update=99999999
filters=10
size=1
stride=1
pad=0
activation=logistic

#L198
[route]
layers=-8

#L199 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L200 64x64 0.302GFLOPS
[convolutional]
dont_update=99999999
batch_normalize=1
filters=320
size=3
stride=1
pad=1
activation=swish

#L201 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L202
[route]
layers=-2

#L203 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L204
[route]
layers=-4

#L205 64x64 0.003GFLOPS
[convolutional]
dont_update=99999999
filters=5
size=1
stride=1
pad=0
activation=logistic

#L206
[route]
layers=-5,-13,-3,-11,-1,-9

#L207
[route]
layers = -1
stopbackward=1
#[yolo]

[route]
layers= 0

#320x320
[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=32
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=32
activation=swish

#160x160
[route]
layers= -1, 14

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish
dilation=2

[route]
layers = -5,-3,-2,-1

# 16
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

#80x80
[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=128
activation=swish

#80x80
[route]
layers= -1, 37, 106

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish
dilation=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish
dilation=3

[route]
layers = -1,-3,-5,-7,-9
#layers = -5,-3,-2,-1

# 16
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=swish

#40x40
[route]
layers= -1, 60, 118

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish
dilation=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish
dilation=3

[route]
layers = -1,-3,-5,-7,-9
#layers = -5,-3,-2,-1

# 16
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=swish

#20x20
[route]
layers= -1, 82, 130

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish
dilation=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish
dilation=3

[route]
layers = -1,-3,-5,-7,-9
#layers = -5,-3,-2,-1

# 16
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[upsample]
stride=2

#40x40
[route]
layers= -1, -15

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish
dilation=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish
dilation=3

[route]
layers = -1,-3,-5,-7,-9
#layers = -5,-3,-2,-1

# 16
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[upsample]
stride=2

#80x80
[route]
layers= -1, -41

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish
dilation=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish
dilation=3

[route]
layers = -1,-3,-5,-7,-9
#layers = -5,-3,-2,-1

# 16
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish

[upsample]
stride=2

#160x160
[route]
layers= -1, -67

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish
dilation=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish
dilation=3

[route]
layers = -1,-3,-5,-7,-9

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

# 16
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

[upsample]
stride=2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

[route]
layers=-2

#320x320
[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=32
activation=swish

#256x256
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=32
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=32
activation=swish
dilation=2

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=32
activation=swish
dilation=3

[route]
layers = -6,-3,-2,-1

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=swish

[upsample]
stride=2

#640x640
[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=32
activation=swish

#256x256
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=32
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=32
activation=swish

[convolutional]
size=1
stride=1
pad=1
filters=4
activation=linear

[softmax]
groups=409600
stride=409600
#BGR
num=4
classes=4
counters_per_class=1,1,1,1
colormap=0,0,0, 255,0,0, 255,255,0, 255,0,255